# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

# Пример:

# - 6782 -> 23
# - 0,56 -> 11

# num = int(input("Введите число:"))
# print(num)
# s = str(num)
# sum = 0
# for i in range(len(s)):
#     sum = sum + int(s[i])
# print('Сумма цифр числа', num,' = ', sum)   


# float_num = input('Введите число: ')
# sum = 0
# for i in float_num:
#     if i != '.':
#         sum = sum + int(i)
# print('Сумма цифр числа', float_num,' = ', sum)


